{"test_cases_lookup_map": {"{\"actual_output\": \"\\nDragi student, \\u0161ifre kolegija \\\"Upravljanje poslovnim procesima\\\" i \\\"Programsko in\\u017eenjerstvo\\\" su odgovaraju\\u0107e 6 ECTS bodova.\\n\", \"context\": null, \"expected_output\": \"\\n\\u0160ifra kolegija \\\"Upravljanje poslovnim procesima\\\" je 199739, a \\u0161ifra kolegija \\\"Programsko in\\u017eenjerstvo\\\" je 87243.\\n\", \"hyperparameters\": null, \"input\": \"Koje su \\u0161ifre kolegija Upravljanje poslovnim procesima i Programsko in\\u017eenjerstvo?\", \"retrieval_context\": [\"\\nIZVEDBENI PLAN NASTAVE KOLEGIJA Kod i naziv kolegija 87243, INF007 Programsko in\\u017eenjerstvo Nastavnik/nastavnica  Suradnik/suradnica doc. dr. sc. Nikola Tankovi\\u0107 (nositelj) Studijski program Sveu\\u010dili\\u0161ni preddiplomski studij Informatika Vrsta kolegija Obvezan  Razina kolegija Preddiplomski Semestar Zimski  Godina studija III. Mjesto izvo\\u0111enja Dvorana 402, nova zgrada FET-a \\u201eDr. Mijo Mirkovi\\u0107\\u201c Jezik izvo\\u0111enja Hrvatski Broj ECTS bodova 6,0 Broj sati u semestru 30P \\u2013 30V \\u2013 0S    Preduvjeti za upis i za svladavanje Odslu\\u0161ani kolegiji Programiranje, Baze podataka I, Napredne tehnike programiranja Korelativnost Programiranje, Baze podataka I, Baze podataka II, Strukture podataka i algoritmi, Napredne tehnike programiranja, Web aplikacije Cilj kolegija  Upoznati studente sa suvremenim tehnikama razvoja programskih aplikacija i sustava.   Savladati primjenjive paradigme, programske jezike, knji\\u017enice i radne okvire za razvoj programskih rje\\u0161enja.  Ishodi u\\u010denja 1. Prikupiti i analizirati korisni\\u010dke zahtjeve 2. Primijeniti jezik UML pri oblikovanju sustava 3. Objasniti i primijeniti razli\\u010dite arhitekturne stilove 4. Primijeniti barem dva programska jezika i jedan okvir za razvoj aplikacija 5. Primijeniti agilnu metodu u razvoju programske podr\\u0161ke 6. Primijeniti metode za testiranje programske podr\\u0161ke i oblikovati sustav kontinuiranog testiranja 7. Timskim radom razviti kompletno programsko rje\\u0161enje i pripadnu dokumentaciju koje udovoljava funkcionalnim i nefunkcionalnim zahtjevima Sadr\\u017eaj kolegija 1. Uvod u programsko in\\u017eenjerstvo. Metode razvoja programskih proizvoda s naglaskom na agilne metode. 2. Prikupljanje zahtjeva i prototipiranje sustava. 3. Modeliranje sustava u pomo\\u0107u jezika UML. Modeli UML-a. 4. Programski jezik Javascript. Programski okvir Vue. 5. Implementacija aplikacije u oblaku pomo\\u0107u okvira Vue/Javascript i usluge Firebase.\\nStruktura studija \\\"Upravljanje poslovnim procesima\\\" na prijediplomskom studiju Informatike uklju\\u010duje kolegij pod nazivom \\\"Upravljanje poslovnim procesima\\\" (UPPFIPU) koji se izvodi u zimskom semestru tre\\u0107e godine studija u Puli. Kolegij nosi 6 ECTS bodova i sastoji se od 30 sati predavanja i 30 sati vje\\u017ebi. Nema preduvjeta za upis kolegija, ali je potrebno polo\\u017eiti kolegij \\\"Osnove IKT\\\" za pristup testu ili ispitu.\\n\\nCilj kolegija je usvajanje kompetencija za upravljanje poslovnim procesima, dizajn modela poslovnih procesa te primjena metoda za analizu poslovnih procesa koriste\\u0107i suvremene programske alate i okvire. Ishodi u\\u010denja uklju\\u010duju opisivanje problematike upravljanja poslovnim procesima, obja\\u0161njavanje uloge informacijskih sustava, primjenu optimalnih na\\u010dina upravljanja poslovnim procesima, usporedbu referentnih modela i metodolo\\u0161kih okvira te kori\\u0161tenje BPMN, UML i Petri Nets metoda za modeliranje poslovnih procesa.\\n\\nObvezna literatura za kolegij uklju\\u010duje djela \\\"Modeliranje poslovnih procesa\\\" autora Brumec, J. i Brumec, S. (2018) te \\\"Fundamentals of Business Process Management\\\" autora Dumas, M. et al. (2013). Izborna literatura uklju\\u010duje djela \\\"Business Process Management: Concepts, Languages, Architectures\\\" autora Weske, M. (2012) i \\\"Upravljanje poslovnim procesima \\u2013 organizacijski i informacijski pristup\\\" autora Bosilj-Vuk\\u0161i\\u0107, V., Hernaus, T., Kova\\u010di\\u0107, A. (2008).\\n\\nDodatno, za kolegij \\\"Programsko in\\u017eenjerstvo\\\" preporu\\u010dena literatura uklju\\u010duje knjige \\\"Professional Software Development\\\" autora Mike G. Miller (2020), \\\"Software Engineering Body of Knowledge (SWEBOK)\\\" od IEEE (2014), \\\"Clean Architecture: A Craftsman's Guide to Software Structure and Design\\\" autora Robert C. Martin (2017) i \\\"Beginning Software Engineering\\\" autora Rod Stephens (2015). Izborna literatura uklju\\u010duje \\\"Software Engineering at Google: Lessons Learned from Programming Over Time\\\" autora Titues Winters, Tom Manshreck, Hyrum Wright (2020), dok priru\\u010dna literatura uklju\\u010duje \\\"Eloquent JavaScript\\\" autora Marijn Haverbeke (2019), \\\"Learning Vue.js 2\\\" autora Olga Filipova (2016) i \\\"Version Control with Git\\\" autora Jon Loeliger (2012).\\nStruktura studija UPRAVLJANJE POSLOVNIM PROCESIMA\\nUpravljanje poslovnim procesima\\nKod i naziv kolegija: 199739, Upravljanje poslovnim procesima (UPPFIPU)\\nNastavnici\\nizv. prof. dr. sc. Darko Etinger (nositelj)\\nDario Kukuljan, mag. paed. et educ. inf.\\nInformacije o kolegiju\\nStudijski program: Informatika (prijediplomski)\\nVrsta kolegija: obvezni\\nRazina kolegija: prijediplomski\\nSemestar: zimski\\nGodina studija: III.\\nMjesto izvo\\u0111enja: Pula\\nJezik izvo\\u0111enja: hrvatski, engleski\\nBroj ECTS bodova: 6\\nBroj sati u semestru: 30P - 30V - 0S\\nKorelativnost:\\nFakultet organizacije i informatike Vara\\u017edin: Modeliranje poslovnih procesa\\nEkonomski fakultet Zagreb: Upravljanje poslovnim procesima\\nPreduvjeti:\\nNema preduvjeta za upis kolegija.\\nPreduvjet za pristup testu ili prijavu ispita je prethodno polo\\u017een kolegij Osnove IKT.\\nCilj kolegija\\nUsvojiti kompetencije za upravljanje poslovnim procesima, dizajn modela poslovnih procesa i primjena metoda\\nza analizu poslovnih procesa koriste\\u0107i suvremene programske alate i okvire.\\nIshodi u\\u010denja\\n1.Opisati problematiku upravljanja poslovnim procesima, interpretirati osnovna obilje\\u017eja, prednosti i ne-\\ndostatke procesnog pristupa.\\n2.Objasniti ulogu integralnoga informacijskog sustava i sustava za upravljanje poslovnim procesima, u\\npostizanju vi\\u0161e razine procesne zrelosti.\\n3.Primijeniti optimalni na\\u010din upravljanja poslovnim procesima na temelju analize i prikazivanja, unaprje\\u0111i-\\nvanja i mjerenja te primjene koncepta procesne zrelosti.\\n4.Usporediti referentne modele i metodolo\\u0161ke okvire koji olak\\u0161avaju provedbu projekata promjene poslovnih\\nprocesa.\\n5. Koristiti BPMN, UML i Petri Nets metode za modeliranje poslovnih procesa.\\n6. Primijeniti programske alate za oblikovanje i analizu poslovnih procesa.\\nSadr\\u017eaj kolegija\\n1. Procesni pristup - orijentacija na poslovne procese.\\n2. Procesno orijentirana organizacija.\\n3. Analiza poslovnih procesa, upravljanje poslovnim procesima.\\n4. Znanje u poslovnim procesima i informacijskom sustavu.\\n5. Organizacijski i informacijski pristup razvoju sustava za upravljanje poslovnim procesima.\\n6. Metode modeliranja poslovnih procesa i razvoja modela poduze\\u0107a.\\n7. BPMN - Business process model and notation\\nStranica 214\\nKolegij \\\"Programsko in\\u017eenjerstvo\\\" na Sveu\\u010dili\\u0161nom preddiplomskom studiju Informatika, kojeg vodi doc. dr. sc. Nikola Tankovi\\u0107, obvezan je za tre\\u0107u godinu studija u zimskom semestru. Kolegij se odr\\u017eava u dvorani 402 nove zgrade FET-a \\u201eDr. Mijo Mirkovi\\u0107\\u201c na hrvatskom jeziku i nosi 6 ECTS bodova. Preduvjeti za upis uklju\\u010duju odslu\\u0161ane kolegije Programiranje, Baze podataka I i Napredne tehnike programiranja. Cilj kolegija je upoznati studente sa suvremenim tehnikama razvoja programskih aplikacija i sustava, te savladati primjenjive paradigme, programske jezike, knji\\u017enice i radne okvire.\\n\\nIshodi u\\u010denja uklju\\u010duju prikupljanje i analizu korisni\\u010dkih zahtjeva, primjenu UML jezika, obja\\u0161njavanje i primjenu razli\\u010ditih arhitekturnih stilova, kori\\u0161tenje barem dva programska jezika i jednog okvira za razvoj aplikacija, primjenu agilne metode, metode za testiranje programske podr\\u0161ke i oblikovanje sustava kontinuiranog testiranja, te timski rad na razvoju kompletnog programskog rje\\u0161enja.\\n\\nSadr\\u017eaj kolegija obuhva\\u0107a uvod u programsko in\\u017eenjerstvo, prikupljanje zahtjeva i prototipiranje sustava, modeliranje sustava pomo\\u0107u UML-a, programski jezik Javascript i okvir Vue, implementaciju aplikacije u oblaku pomo\\u0107u Vue/Javascript i Firebase, alate za upravljanje ina\\u010dicama koda (Git, GitHub), sustave za pohranu podataka u oblaku (Firebase Firestore i Storage), te verifikaciju programske podr\\u0161ke (unit testovi, end-to-end testovi, sustav za kontinuiranu integraciju).\\n\\nStudenti su obvezni poha\\u0111ati nastavu, izraditi projektni zadatak, pristupiti kontrolnim zada\\u0107ama i usmenom ispitu. Projektni zadatak nosi 50% ocjene, kontrolne zada\\u0107e 10%, a usmeni ispit 40%. Da bi polo\\u017eili kolegij, studenti moraju ostvariti najmanje 50% bodova putem aktivnosti kontinuiranog pra\\u0107enja ili pristupiti zavr\\u0161nom ispitu.\\n6. Alati za upravljanjem ina\\u010dicama programskog koda. Alat Git, usluga GitHub i proces kolaborativnog razvoja. 7. Sustavi za pohranu podataka u oblaku Firebase Firestore i Storage. 8. Verifikacija programske podr\\u0161ke. Unit testovi i testovi end-to-end tipa. Sustav za kontinuiranu integraciju softvera.\\nPlanirane aktivnosti, metode u\\u010denja i pou\\u010davanja i na\\u010dini vrednovanja Obveze Ishodi Sati ECTS Maksimalni udio u ocjeni (%) Poha\\u0111anje nastave  1-6 28 1,0 0%  Projekt  1-7 98 3,5 50%  Kontrolne zada\\u0107e  1-6 14 0,5 10%  Usmeni ispit  1-6  28 1,0 40%  Ukupno 168 6,0 100%  Dodatna poja\\u0161njenja (kriteriji ocjenjivanja):  Poha\\u0111anje nastave: Tijekom predavanja se studentima prezentiraju koncepti vezani uz razvoj raspodijeljenih vi\\u0161eslojnih aplikacija te se isti ilustriraju prakti\\u010dnim primjerima kroz vje\\u017ebe u ra\\u010dunalnom laboratoriju.   Projektni zadatak: Studenti su du\\u017eni samostalno odabrati temu projektnoga zadataka koju im odobrava nastavnik. Unaprijed \\u0107e se definirati tematski okvir i potrebna koli\\u010dina funkcionalnosti. Pri izradi projektnog zadatka mogu\\u0107e je samostalno odabrati kori\\u0161tene programske jezike i okvire. Projektni zadatak potrebno je realizirati kroz dvije komponente: prototip aplikacije i sama aplikacija. Studenti su du\\u017eni izra\\u0111en projekt postaviti na jedan od sustava za upravljanje ina\\u010dicama izvori\\u0161nog koda pomo\\u0107u kojega \\u0107e se pratiti napredak u izgradnji projekta te dodatno postaviti poveznicu na izvori\\u0161ni kod na za to predvi\\u0111eno mjesto na e-u\\u010denju. Uspje\\u0161no obranjen projekt nosi najvi\\u0161e 50 bodova, od \\u010dega se 5 bodova odnosi na prototip, 20 bodova na komponente klijenta, 20 bodova na komponente poslu\\u017eitelja i 5 bodova na izlaganje projekta. Kori\\u0161tenje tu\\u0111eg rje\\u0161enja (plagijat) je zabranjeno te povla\\u010di disciplinsku odgovornost.  Kontrolne zada\\u0107e: Tijekom izvo\\u0111enja nastave provest \\u0107e se provjere znanja koje \\u0107e razmjerno pridonijeti kona\\u010dnim bodovima u maksimalnom iznosu od 10%. Svaka provjera sastoji se u ostvarivanju tra\\u017eene funkcionalnosti pomo\\u0107u skriptnih jezika i biblioteka obra\\u0111enih kroz prethodna predavanja.  Usmeni ispit: Na usmenom ispitu u zadnjem tjednu nastave utvr\\u0111uje se poznavanje iznesene gra\\u0111e kolegija sukladno ishodima u\\u010denja. Mogu\\u0107e je ostvariti do 40% bodova.  Ispit je polo\\u017een ukoliko je student putem aktivnosti kontinuiranog pra\\u0107enja tijekom semestra ostvari najmanje 50% bodova. Ocjena kontinuiranog pra\\u0107enja se temeljem ostvarenih bodova oblikuje prema sljede\\u0107oj skali:\\nTekst pru\\u017ea osnovne informacije o varijablama i operatorima u JavaScriptu, uklju\\u010duju\\u0107i pravila za deklaraciju varijabli s `const`, razli\\u010dite tipove podataka, te kori\\u0161tenje stringova i eksponencijalne notacije. Obja\\u0161njava osnovne operatore kao \\u0161to su aritmeti\\u010dki, pridru\\u017eivanja, usporedni, logi\\u010dki i tipa operatori, te njihovu upotrebu. JavaScript se koristi za izradu interaktivnih web stranica, kao i za server-side, desktop i mobilne aplikacije. Postoje tri na\\u010dina pisanja JavaScript koda u web pregledniku: inline, internal i external JavaScript.\\n\\nTekst tako\\u0111er pokriva kontrolne strukture poput if-else, logi\\u010dke operatore, uvjete za dobivanje zajma, iteracije i petlje, te kori\\u0161tenje break i continue naredbi. Detaljno se razra\\u0111uju funkcije, njihova deklaracija, pozivanje i razli\\u010diti na\\u010dini kori\\u0161tenja, uklju\\u010duju\\u0107i funkcije vi\\u0161eg reda i rekurziju. Obja\\u0161njava se validacija forme i daje primjere funkcija za razli\\u010dite zadatke.\\n\\nStruktura studija \\\"Upravljanje poslovnim procesima\\\" na prijediplomskom studiju Informatike uklju\\u010duje kolegij \\\"Upravljanje poslovnim procesima\\\" koji se izvodi u zimskom semestru tre\\u0107e godine u Puli. Kolegij nosi 6 ECTS bodova, sastoji se od 30 sati predavanja i 30 sati vje\\u017ebi, te nema preduvjeta za upis, ali je potrebno polo\\u017eiti kolegij \\\"Osnove IKT\\\". Cilj kolegija je usvajanje kompetencija za upravljanje poslovnim procesima, dizajn modela poslovnih procesa te primjena metoda za analizu poslovnih procesa koriste\\u0107i suvremene alate i okvire.\\n\\nKolegij \\\"Programsko in\\u017eenjerstvo\\\" na Sveu\\u010dili\\u0161nom preddiplomskom studiju Informatika, kojeg vodi doc. dr. sc. Nikola Tankovi\\u0107, obvezan je za tre\\u0107u godinu studija u zimskom semestru. Kolegij se odr\\u017eava u dvorani 402 nove zgrade FET-a \\u201eDr. Mijo Mirkovi\\u0107\\u201c na hrvatskom jeziku i nosi 6 ECTS bodova. Preduvjeti za upis uklju\\u010duju odslu\\u0161ane kolegije Programiranje, Baze podataka I i Napredne tehnike programiranja. Cilj kolegija je upoznati studente sa suvremenim tehnikama razvoja programskih aplikacija i sustava, te savladati primjenjive paradigme, programske jezike, knji\\u017enice i radne okvire.\\n\\nPravilnik o studiranju na daljinu na Sveu\\u010dili\\u0161tu Jurja Dobrile u Puli ure\\u0111uje pravila online studiranja, organizaciju nastave, sustav pra\\u0107enja i vrednovanja studenata, te prava i obveze studenata. Online nastava se izvodi na hrvatskom i engleskom jeziku, a Sveu\\u010dili\\u0161te osigurava potrebnu ra\\u010dunalnu podr\\u0161ku i kontinuirano usavr\\u0161avanje nastavnog osoblja. Studenti imaju pristup online mentorima, administrativnoj i tehni\\u010dkoj podr\\u0161ci, te materijalima za nastavu u digitalnom obliku. Studenti su du\\u017eni ispuniti minimalne tehni\\u010dke uvjete za pra\\u0107enje nastave, a ispiti se provode online ili u kontroliranim uvjetima. Sveu\\u010dili\\u0161te tako\\u0111er ima sustav osiguravanja kvalitete koji uklju\\u010duje razli\\u010dite postupke pra\\u0107enja i unapre\\u0111ivanja kvalitete studijskih programa.\\n\"]}": {"cached_metrics_data": [{"metric_metadata": {"metric": "Answer Relevancy", "threshold": 0.5, "success": false, "score": 0.0, "reason": "The score is 0.00 because the output includes greetings and information about ECTS credits, neither of which address the request for course codes.", "strictMode": false, "evaluationModel": "gpt-4o", "evaluationCost": 0}, "metric_configuration": {"threshold": 0.5, "evaluation_model": "gpt-4o", "strict_mode": false, "include_reason": true}}, {"metric_metadata": {"metric": "Faithfulness", "threshold": 0.5, "success": true, "score": 1.0, "reason": "The score is 1.00 because there are no contradictions. Great job maintaining perfect alignment with the retrieval context!", "strictMode": false, "evaluationModel": "gpt-4o", "evaluationCost": 0}, "metric_configuration": {"threshold": 0.5, "evaluation_model": "gpt-4o", "strict_mode": false, "include_reason": true}}]}}}